Revit 2024 API
FluidTemperature.Temperature Property
 The temperature value
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double Temperature { get; set; }
Visual Basic
Public Property Temperature As Double
	Get
	Set
Visual C++
public:
property double Temperature {
	double get ();
	void set (double value);
}
See Also
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace